GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F425.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DMC</name>
            <description>Dynamic memory controler</description>
            <alternatePeripheral>SMC</alternatePeripheral>
            <groupName>DMC</groupName>
            <baseAddress>0xA0000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Configuraion register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00141388</resetValue>
                    <fields>
                        <field>
                            <name>BAWCFG</name>
                            <description>Bank Address Width Configure</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RAWCFG</name>
                            <description>Row Address Width Configure</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CAWCFG</name>
                            <description>Column Address Width Configure</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DWCFG</name>
                            <description>Data Width Configure</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIM0</name>
                    <displayName>TIM0</displayName>
                    <description>Timing register 0</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x019A5252</resetValue>
                    <fields>
                        <field>
                            <name>CASLSEL0</name>
                            <description>CAS Latency Select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RASMINTSEL</name>
                            <description>RAS Minimum Time Select</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DTIMSEL</name>
                            <description>RAS To CAS Delay Time Select</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>PCPSEL</name>
                            <description>Precharge Period Select</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>WRTIMSEL</name>
                            <description>WRTIMSEL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ARPSEL</name>
                            <description>Auto-Refresh Period Select</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>XSR0</name>
                            <description>XSR0</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ATACP</name>
                            <description>Active to active</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ECASLSEL1</name>
                            <description>Extended CAS Latency</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXSR1</name>
                            <description>EXSR1</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIM1</name>
                    <displayName>TIM1</displayName>
                    <description>Timing register 1</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00074E20</resetValue>
                    <fields>
                        <field>
                            <name>STBTIM</name>
                            <description>Stable Time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>ARNUMCFG</name>
                            <description>Number Of Auto-Refresh During Initialization Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>Control register 1</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00003048</resetValue>
                    <fields>
                        <field>
                            <name>INIT</name>
                            <description>SDRAM Initialize</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRMEN</name>
                            <description>Put SDRM in Self-Refresh Mode Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDMEN</name>
                            <description>Put SDRM in Power-Down Mode Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCACFG</name>
                            <description>Precharge Algorithm Configure</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRBSREN</name>
                            <description>Full Refresh Before Entering Self-Refresh Mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRASREN</name>
                            <description>Full Refresh After Exit Self-Refresh Mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDNUMMCFG</name>
                            <description>Configure Number Of Registers Inserted In Read Data Path</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODESET</name>
                            <description>Mode Setup</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRMFLG</name>
                            <description>Self-refresh mode flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BANKNUMCFG</name>
                            <description>Number Of Open Banks Configure</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REF</name>
                    <displayName>REF</displayName>
                    <description>refresh register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000000C3</resetValue>
                    <fields>
                        <field>
                            <name>RCYCCFG</name>
                            <description>RCYCCFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SW</name>
                    <displayName>SW</displayName>
                    <description>switch register</description>
                    <addressOffset>0x400</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCSW</name>
                            <description>Memory Controller Function Switch</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>Control register 2</description>
                    <addressOffset>0x404</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000000AE</resetValue>
                    <fields>
                        <field>
                            <name>CPHACFG</name>
                            <description>Clock Phase Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDDEN</name>
                            <description>RD Delay Function Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDDCFG1</name>
                            <description>RD Clock Delay Configure</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>WPEN</name>
                            <description>Write Pipe Enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUFFEN</name>
                            <description>DMC Accelerate Module Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRPBSEL</name>
                            <description>WRAP Burst Type Selection</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDDCFG2</name>
                            <description>RD Clock Delay Configure</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
