GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F425.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SDIO</name>
            <description>Secure digital input/output interface</description>
            <groupName>SDIO</groupName>
            <baseAddress>0x40012C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SDIO</name>
                <description>SDIO global interrupt</description>
                <value>49</value>
            </interrupt>
            <registers>
                <register>
                    <name>PWRCTRL</name>
                    <displayName>PWRCTRL</displayName>
                    <description>power control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PWRCTRL</name>
                            <description>Power Supply Control</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKCTRL</name>
                    <displayName>CLKCTRL</displayName>
                    <description>SDI clock control register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HFCEN</name>
                            <description>HW Flow Control enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEPSEL</name>
                            <description>SDIO_CK dephasing selection
 bit</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WBSEL</name>
                            <description>Wide bus mode enable bit</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BYPASSEN</name>
                            <description>Clock divider bypass enable
 bit</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRSAV</name>
                            <description>Power saving configuration
 bit</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLKEN</name>
                            <description>Clock enable bit</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIV</name>
                            <description>Clock divide factor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARG</name>
                    <displayName>ARG</displayName>
                    <description>argument register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CMDARG</name>
                            <description>Command argument</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMD</name>
                    <displayName>CMD</displayName>
                    <description>command register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ATACMD</name>
                            <description>CE-ATA command</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INTEN</name>
                            <description>not Interrupt Enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMDCPEN</name>
                            <description>Enable CMD completion</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDIOSC</name>
                            <description>SD I/O suspend command</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CPSMEN</name>
                            <description>Command path state machine (CPSM) Enable
 bit</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WENDDATA</name>
                            <description>CPSM Waits for ends of data transfer (CmdPend internal signal).</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITINT</name>
                            <description>CPSM waits for interrupt
 request</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITRES</name>
                            <description>Wait for response bits</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CMDINDEX</name>
                            <description>Command index</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDRES</name>
                    <displayName>CMDRES</displayName>
                    <description>command response register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CMDRES</name>
                            <description>Response command index</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RES1</name>
                    <displayName>RES1</displayName>
                    <description>response 1 register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CARDSTS1</name>
                            <description>Card status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RES2</name>
                    <displayName>RES2</displayName>
                    <description>response 2 register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CARDSTS2</name>
                            <description>Card status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RES3</name>
                    <displayName>RES3</displayName>
                    <description>response 3 register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CARDSTS3</name>
                            <description>Card status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RES4</name>
                    <displayName>RES4</displayName>
                    <description>response 4 register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CARDSTS4</name>
                            <description>Card status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATATIME</name>
                    <displayName>DATATIME</displayName>
                    <description>data timer register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATATIME</name>
                            <description>Data timeout period</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATALEN</name>
                    <displayName>DATALEN</displayName>
                    <description>data length register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATALEN</name>
                            <description>Data length value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCTRL</name>
                    <displayName>DCTRL</displayName>
                    <description>data control register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SDIOF</name>
                            <description>SD I/O enable functions</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDWAIT</name>
                            <description>Read wait mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RWSTOP</name>
                            <description>Read wait stop</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RWSTR</name>
                            <description>Read wait start</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBSIZE</name>
                            <description>Data block size</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMA enable bit</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTSEL</name>
                            <description>Data transfer mode selection 1: Stream
 or SDIO multibyte data transfer.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTDRCFG</name>
                            <description>Data transfer direction
 selection</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTEN</name>
                            <description>Data Transfer Enabled</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCNT</name>
                    <displayName>DCNT</displayName>
                    <description>data counter register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATACNT</name>
                            <description>Data count value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
