GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F425.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>Ethernet_PTP</name>
            <description>Ethernet: Precision time protocol</description>
            <groupName>Ethernet</groupName>
            <baseAddress>0x40028700</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TSCTRL</name>
                    <displayName>TSCTRL</displayName>
                    <description>Ethernet PTP time stamp control
          register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00002000</resetValue>
                    <fields>
                        <field>
                            <name>TSEN</name>
                            <description>Time Stamp Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSUDSEL</name>
                            <description>Time Stamp Update Mode Select</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSSTINIT</name>
                            <description>Time Stamp System Time Initialize</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSSTUD</name>
                            <description>Time Stamp System Time Update</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSTRGIEN</name>
                            <description>Time Stamp Trigger Interrupt Enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSADDUD</name>
                            <description>Time Stamp Addend Register Update</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSSNEN</name>
                            <description>Time Stamp Snapshot for Received Frames Enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSSUBRO</name>
                            <description>Time Stamp Subsecond Rollover</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LISTVSEL</name>
                            <description>Listening Version Select</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSSPTPEN</name>
                            <description>Time Stamp Snapshot for PTP Ethernet Frames Enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSS6EN</name>
                            <description>Time stamp snapshot for IPv6 frames Enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSS4EN</name>
                            <description>Time Stamp Snapshot for IPv4 Frames Enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSSMESEL</name>
                            <description>Time Stamp Snapshot for Message Select</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSSMNSEL</name>
                            <description>Time Stamp Snapshot for Master Node Select</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSCLKNSEL</name>
                            <description>Time stamp Clock Node Select</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TSSPTPFMACEN</name>
                            <description>Time Stamp PTP Frame Filtering MAC Address Enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SUBSECI</name>
                    <displayName>SUBSECI</displayName>
                    <description>Ethernet PTP subsecond increment
          register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STSUBSECI</name>
                            <description>System Time Subseconds Incremen</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSH</name>
                    <displayName>TSH</displayName>
                    <description>Ethernet PTP time stamp high
          register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STSEC</name>
                            <description>System Time Second Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSL</name>
                    <displayName>TSL</displayName>
                    <description>Ethernet PTP time stamp low
          register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STSUBSEC</name>
                            <description>System Time Subseconds Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
                        <field>
                            <name>STSEL</name>
                            <description>System Time Select</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSHUD</name>
                    <displayName>TSHUD</displayName>
                    <description>Ethernet PTP time stamp high update
          register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSUDSEC</name>
                            <description>Time Stamp Update Second Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSLUD</name>
                    <displayName>TSLUD</displayName>
                    <description>Ethernet PTP time stamp low update
          register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSUDSUBSEC</name>
                            <description>Time Stamp Update Subseconds Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
                        <field>
                            <name>TSUDSEL</name>
                            <description>Time Stamp Update Select</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSA</name>
                    <displayName>TSA</displayName>
                    <description>Ethernet PTP time stamp addend
          register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSA</name>
                            <description>Time Stamp Addend Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TTSH</name>
                    <displayName>TTSH</displayName>
                    <description>Ethernet PTP target time high
          register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TTSH</name>
                            <description>Target Time Stamp High Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TTSL</name>
                    <displayName>TTSL</displayName>
                    <description>Ethernet PTP target time low
          register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TTSL</name>
                            <description>Target Time Stamp Low Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSSTS</name>
                    <displayName>TSSTS</displayName>
                    <description>Ethernet PTP time stamp status
          register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSSECOVR</name>
                            <description>Time Stamp Second Value Overflow</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TTSRD</name>
                            <description>Target Time Stamp Value Reached</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PPSCTRL</name>
                    <displayName>PPSCTRL</displayName>
                    <description>Ethernet PTP PPS control
          register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PPSFSEL</name>
                            <description>PPS Frequency Selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
