GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F425.svd
                <register>
                    <name>GRXFIFO</name>
                    <displayName>GRXFIFO</displayName>
                    <description>OTG_FS Receive FIFO size register
          (OTG_FS_GRXFSIZ)</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>RXFDEP</name>
                            <description>RxFIFO depth</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTXFCFG</name>
                    <displayName>GTXFCFG</displayName>
                    <description>OTG_FS non-periodic transmit FIFO size
          register (Device mode)</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>EPTXSA</name>
                            <description>Endpoint 0 transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>EPTXFDEP</name>
                            <description>Endpoint 0 TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTXFCFGH</name>
                    <displayName>GTXFCFGH</displayName>
                    <description>OTG_FS non-periodic transmit FIFO size
          register (Host mode)</description>
                    <alternateRegister>GTXFCFG</alternateRegister>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>NPTXSA</name>
                            <description>Non-periodic transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>NPTXFDEP</name>
                            <description>Non-periodic TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GNPTXFQSTS</name>
                    <displayName>GNPTXFQSTS</displayName>
                    <description>OTG_FS non-periodic transmit FIFO/queue
status register (OTG_FS_GNPTXFQSTS)</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00080200</resetValue>
                    <fields>
                        <field>
                            <name>NPTXFSA</name>
                            <description>Non-periodic TxFIFO space
              available</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>NPTXRSA</name>
                            <description>Non-periodic transmit request queue
              space available</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>NPTXRQ</name>
                            <description>Top of the non-periodic transmit request
              queue</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GGCCFG</name>
                    <displayName>GGCCFG</displayName>
                    <description>OTG_FS general core configuration register
          (OTG_FS_GCCFG)</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PWEN</name>
                            <description>Power down</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADVBSEN</name>
                            <description>Enable the VBUS sensing
              device</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BDVBSEN</name>
                            <description>Enable the VBUS sensing
              device</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOFPOUT</name>
                            <description>SOF output enable</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VBSDIS</name>
                            <description>VBUS Sensing Disable</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GCID</name>
                    <displayName>GCID</displayName>
                    <description>core ID register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00001000</resetValue>
                    <fields>
                        <field>
                            <name>PID</name>
                            <description>Product ID field</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GHPTXFSIZE</name>
                    <displayName>GHPTXFSIZE</displayName>
                    <description>OTG_FS Host periodic transmit FIFO size
register (OTG_FS_GHPTXFSIZE)</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000600</resetValue>
                    <fields>
                        <field>
                            <name>HPDTXFSA</name>
                            <description>Host periodic TxFIFO start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>HPDTXFDEP</name>
                            <description>Host periodic TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO1</name>
                    <displayName>DTXFIFO1</displayName>
                    <description>OTG_FS device IN endpoint transmit FIFO size
register (OTG_FS_DTXFIFO1)</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFO2 transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO2</name>
                    <displayName>DTXFIFO2</displayName>
                    <description>OTG_FS device IN endpoint transmit FIFO size
register (OTG_FS_DTXFIFO2)</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFO3 transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO3</name>
                    <displayName>DTXFIFO3</displayName>
                    <description>OTG_FS device IN endpoint transmit FIFO size
register (OTG_FS_DTXFIFO3)</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFO4 transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
