GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F425.svd
                <register>
                    <name>HCH3</name>
                    <displayName>HCH3</displayName>
                    <description>OTG_FS host channel-3 characteristics
          register (OTG_FS_HCCHAR3)</description>
                    <addressOffset>0x160</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPSIZE</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EDPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDPDRT</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSDV</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EDPTYP</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNTSEL</name>
                            <description>Multicount</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DVADDR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDF</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHINT</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH4</name>
                    <displayName>HCH4</displayName>
                    <description>OTG_FS host channel-4 characteristics
          register (OTG_FS_HCCHAR4)</description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPSIZE</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EDPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDPDRT</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSDV</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EDPTYP</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNTSEL</name>
                            <description>Multicount</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DVADDR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDF</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHINT</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH5</name>
                    <displayName>HCH5</displayName>
                    <description>OTG_FS host channel-5 characteristics
          register (OTG_FS_HCCHAR5)</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPSIZE</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EDPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDPDRT</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSDV</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EDPTYP</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNTSEL</name>
                            <description>Multicount</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DVADDR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDF</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHINT</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH6</name>
                    <displayName>HCH6</displayName>
                    <description>OTG_FS host channel-6 characteristics
          register (OTG_FS_HCCHAR6)</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPSIZE</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EDPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDPDRT</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSDV</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EDPTYP</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNTSEL</name>
                            <description>Multicount</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DVADDR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDF</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHINT</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH7</name>
                    <displayName>HCH7</displayName>
                    <description>OTG_FS host channel-7 characteristics
          register (OTG_FS_HCCHAR7)</description>
                    <addressOffset>0x1E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPSIZE</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EDPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDPDRT</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSDV</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EDPTYP</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNTSEL</name>
                            <description>Multicount</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DVADDR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDF</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHINT</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHINT0</name>
                    <displayName>HCHINT0</displayName>
                    <description>OTG_FS host channel-0 interrupt register
          (OTG_FS_HCINT0)</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPN</name>
                            <description>Transfer completed</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPAN</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALL</name>
                            <description>STALL response received
              interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAK</name>
                            <description>NAK response received
              interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACK</name>
                            <description>ACK response received/transmitted
              interrupt</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERR</name>
                            <description>Transaction error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLE</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVR</name>
                            <description>Frame overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOG</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHINT1</name>
                    <displayName>HCHINT1</displayName>
                    <description>OTG_FS host channel-1 interrupt register
          (OTG_FS_HCINT1)</description>
                    <addressOffset>0x128</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPN</name>
                            <description>Transfer completed</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPAN</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALL</name>
                            <description>STALL response received
              interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAK</name>
                            <description>NAK response received
              interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACK</name>
                            <description>ACK response received/transmitted
              interrupt</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERR</name>
                            <description>Transaction error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLE</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVR</name>
                            <description>Frame overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOG</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
